import 'package:flutter/material.dart';

class SqUserdoc extends StatefulWidget {
  @override
  _SqUserdocState createState() => _SqUserdocState();
}

class _SqUserdocState extends State<SqUserdoc> {
  @override
  Widget build(BuildContext context) {
    Size a = MediaQuery.of(context).size;
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Colors.black,
        actions: <Widget>[
          Container(
            padding: EdgeInsets.only(left: a.width / 20, right: a.width / 20),
            color: Colors.black,
            width: a.width,
            child: Row(
              mainAxisAlignment: MainAxisAlignment.spaceBetween,
              children: <Widget>[
                InkWell(
                  child: Icon(
                    Icons.arrow_back,
                    color: Colors.white,
                  ),
                  onTap: () {
                    Navigator.pop(context);
                  },
                ),
                Text(
                  "นโยบายความเป็นส่วนตัว",
                  style: TextStyle(color: Colors.white, fontSize: a.width / 20),
                ),
                Text("")
              ],
            ),
          )
        ],
      ),
      body: ListView(
        children: <Widget>[
          Container(
            padding: EdgeInsets.all(a.width / 40),
            child: SizedBox(
              width: a.width,
              child: Text(
                "นโยบายนี้จะอธิบายถึงข้อมูลที่เราประมวลผลเพื่อสนับสนุน SCRAP. รวมถึงผลิตภัณฑ์และฟีเจอร์อื่นๆที่ SCRAP. นำเสนอคุณสามารถค้นหาเครื่องมือและข้อมูลเพิ่มเติมได้ในการตั้งค่าใน SCRAP. และข้อกำหนดและเงื่อนไขการใช้งานแอปพลิเคชัน SCRAP.\nคำนิยาม\nภายในข้อกำหนดนี้\n   (ก) “แอปพลิเคชัน” หมายความว่า แอปพลิเคชัน ชื่อว่า SCRAP. ซึ่งดำเนินการและให้บริการในลักษณะดังต่อไปนี้ ผู้ใช้บริการสามารถใช้ฟังก์ชั่นต่างๆได้แก่\n -การอ่านข้อความจากผู้ใช้งานรายอื่น \n -การส่งข้อความให้กับผู้ใช้งานรายอื่น \n -การเขียนข้อความไว้ ณ สถานที่ต่างๆ\n   (ข) “เจ้าของแอพพลิเคชั่น” หมายความว่า บริษัท บัวลอยเทค จำกัด ทะเบียนนิติบุคคลเลขที่ 0905562005788 สำนักงานตั้งอยู่ที่ 41/234 ซอยชื่นจิต ถนนนิพัทธ์สงเคราะห์1 \nตำบลหาดใหญ่ จังหวัดสงขลา\n   (ค) “ผู้ใช้งาน” หมายความว่า ผู้เยี่ยมชม ผู้ใช้ สมาชิก ของแอปพลิเคชั่น หรือบุคคลอื่นใดที่เข้าถึงแอปพลิเคชั่น ไม่ว่าการเยี่ยมชม การใช้ การเป็นสมาชิก หรือการเข้าถึงนั้นจะกระทำด้วยวิธีใด ลักษณะวิธีใด ผ่านอุปกรณ์ใด ผ่านช่องทางใด และไม่ว่ามีค่าใช้จ่ายหรือไม่ก็ตาม\n   (ง) “ข้อมูลส่วนบุคคล” หมายความว่า ข้อมูลใดๆ ก็ตามไม่ว่าของผู้ใช้งานหรือบุคคลอื่นใดที่สามารถใช้ในการระบุตัวตนของบุคคลบุคคลนั้นได้ ไม่ว่าทางตรงหรือทางอ้อม\n   (จ) “เนื้อหา” หมายความว่า ข้อความ บทความ ความคิดเห็น บทวิเคราะห์ รูปภาพ สัญลักษณ์ เครื่องหมาย รูปภาพประดิษฐ์ ภาพถ่าย ภาพเคลื่อนไหว ภาพยนต์ เสียง \nสิ่งบันทึกเสียง การออกแบบ คำสั่ง ชุดคำสั่ง หรือการสื่อสารไม่ว่าลักษณะใดและวิธีใดๆ\nในแอปพลิเคชัน และไม่ว่าเนื้อหานั้นจะมีการจำกัดการเข้าถึงหรือไม่ก็ตาม\nเราเก็บรวบรวมข้อมูลประเภทใดบ้าง\nเราต้องรวบรวมข้อมูลเกี่ยวกับคุณเพื่อให้บริการผลิตภัณฑ์ SCRAP. ประเภทของข้อมูลที่เราเก็บรวบรวมขึ้นอยู่กับวิธีที่คุณใช้ผลิตภัณฑ์ของเรา + และข้อกำหนดและเงื่อนไขการใช้งานแอปพลิเคชัน SCRAP.\nข้อมูลที่ผู้ใช้งานจำเป็นต้องให้เราเพื่อสมัครสมาชิก\n - อีเมลของผู้ใช้งาน\n - เบอร์โทรศัพท์ของผู้ใช้งาน\nข้อมูลในขณะที่ใช้งาน\n - ข้อความที่ผู้ใช้งานเขียน\n - ข้อความที่ผู้ใช้งานส่งถึงผู้ใช้งานรายอื่น\n - ข้อความที่ผู้ใช้งานเก็บไว้\n - รายชื่อผู้ใช้งานที่คุณส่งข้อความด้วยล่าสุด\n - ตำแหน่งในขณะที่ใช้งาน\nเราใช้ข้อมูลที่รวบรวมมาอย่างไร\nเราจะใช้ข้อมูลที่เก็บรวบรวมจากผู้ใช้งานเมื่อผู้ใช้งานมีการกระทำการอันผิดต่อข้อกำหนดและเงื่อนไขการใช้งานแอปพลิเคชัน SCRAP. หรือผิดต่อกฏหมาย\nการเปลี่ยนแปลงของนโยบายนี้ \nเราเปลี่ยนแปลงนโยบายความเป็นส่วนตัวนี้เป็นครั้งคราว เราจะไม่ลดทอนสิทธิ์ของคุณภายใต้นโยบายความเป็นส่วนตัวนี้หากไม่ได้รับคำยินยอมโดยชัดแจ้งจากคุณ เราระบุวันที่เผยแพร่การเปลี่ยนแปลงครั้งล่าสุดไว้เสมอและเรามีบันทึกเวอร์ชันอื่นๆ ไว้ให้คุณอ่านด้วย หากมีการเปลี่ยนแปลงที่สำคัญ เราจะประกาศให้ทราบอย่างชัดเจนยิ่งขึ้น",
                style: TextStyle(
                    fontWeight: FontWeight.bold, fontSize: a.width / 20),
              ),
            ),
          )
        ],
      ),
    );
  }
}
